📁 Scanning directory: anarchist

🗂️  Total files:          1967
📂 Total folders:          657

🧾 File breakdown:
  📄 HTML files       :    50
  📓 Markdown files   :    53
  🐍 Python files      :   861
  📜 JavaScript files  :    22
  🎨 CSS files         :    15
  🖼️  Image files       :    57
  🧾 Citation (.cff)   :     1

📚 Folder structure (first 3 levels):
anarchist
├── 📓 5-science.md
├── 🧾 1-pessimism.cff
├── 📓 2-bge.md
├── 📓 4-dionysus.md
├── 📓 3-robustness.md
├── 4-dionysian
├── 📓 README.md
├── 6-binary
├── 5-algorithm
├── 📓 6-morality.md
├── 1-chaos
├── 2-frenzy
├── kitabo
│   ├── ensi
│   │   ├── 📓 bibliography.md
│   │   ├── testbin
│   │   ├── _bibliography
│   │   ├── _static
│   │   ├── act1
│   │   ├── ukuzimba
│   │   ├── figures
│   │   ├── scripts
│   │   ├── pdfs
│   │   ├── nis
│   │   ├── act3
│   │   ├── act2
│   │   ├── media
│   │   ├── ukubona
│   ├── 📓 README.md
├── 3-emotion

✅ Done scanning.










(myenv) apollo@Athena Chords % ./summarize.sh ukubona-llc.github.io --raw

📁 Scanning directory: ukubona-llc.github.io

🗂️  Total files:            95
📂 Total folders:           43

🧾 File breakdown:
  📄 HTML files       :    11
  📓 Markdown files   :     0
  🐍 Python files     :     0
  📜 JavaScript files :    13
  🎨 CSS files        :     4
  🖼️  Image files      :     1
  🧾 Citation (.cff)  :     0
  📦 Compressed files :     0

📚 Folder structure (first 3 levels):
ukubona-llc.github.io
├── .git (hidden)
│   ├── HEAD
│   ├── config
│   ├── description
│   ├── hooks
│   │   ├── applypatch-msg.sample
│   │   ├── commit-msg.sample
│   │   ├── fsmonitor-watchman.sample
│   │   ├── post-update.sample
│   │   ├── pre-applypatch.sample
│   │   ├── pre-commit.sample
│   │   ├── pre-merge-commit.sample
│   │   ├── pre-push.sample
│   │   ├── pre-rebase.sample
│   │   ├── pre-receive.sample
│   │   ├── prepare-commit-msg.sample
│   │   ├── push-to-checkout.sample
│   │   ├── update.sample
│   ├── index
│   ├── info
│   │   ├── exclude
│   ├── logs
│   │   ├── HEAD
│   │   ├── refs
│   ├── objects
│   │   ├── info
│   │   ├── pack
│   ├── packed-refs
│   ├── refs
│   │   ├── heads
│   │   ├── remotes
│   │   ├── tags
├── 📁 assets
│   ├── 📁 images
│   │   ├── 🖼️  ukubona.png
├── 📄 collaborators.html
├── 📄 contact.html
├── 📁 donorcase
│   ├── menu.csv
│   ├── 📁 test
│   │   ├── 📁 assets
│   │   ├── 📄 risk.html
│   ├── 📁 test2
│   │   ├── 📁 assets
│   │   ├── 📄 index.html
│   ├── 📁 test3
│   │   ├── 📁 assets
│   │   ├── 📄 index.html
│   ├── 📁 test4
│   │   ├── 📁 assets
│   │   ├── 📄 index.html
│   ├── 📁 test5
│   │   ├── .DS_Store (hidden)
│   │   ├── 📄 app.html
│   │   ├── 📁 assets
├── favicon.ico
├── 📄 index.html
├── 📄 mission.html
├── 📄 models.html

✅ Done scanning.
(myenv) apollo@Athena Chords % 





📁 Scanning directory: anarchist

🗂️  Total files:          1983
📂 Total folders:          661

🧾 File breakdown:
  📄 HTML files       :    50
  📓 Markdown files   :    53
  🐍 Python files     :   861
  📜 JavaScript files :    22
  🎨 CSS files        :    15
  🖼️  Image files      :    57
  🧾 Citation (.cff)  :     1
  📦 Compressed files :     0

📚 Folder structure (first 3 levels):
anarchist
├── .git (hidden)
│   ├── COMMIT_EDITMSG
│   ├── HEAD
│   ├── config
│   ├── description
│   ├── hooks
│   │   ├── applypatch-msg.sample
│   │   ├── commit-msg.sample
│   │   ├── fsmonitor-watchman.sample
│   │   ├── post-update.sample
│   │   ├── pre-applypatch.sample
│   │   ├── pre-commit.sample
│   │   ├── pre-merge-commit.sample
│   │   ├── pre-push.sample
│   │   ├── pre-rebase.sample
│   │   ├── pre-receive.sample
│   │   ├── prepare-commit-msg.sample
│   │   ├── push-to-checkout.sample
│   │   ├── update.sample
│   ├── index
│   ├── index 2
│   ├── index 2.lock
│   ├── info
│   │   ├── exclude
│   ├── logs
│   │   ├── HEAD
│   │   ├── refs
│   ├── objects
│   │   ├── 00
│   │   ├── 01
│   │   ├── 02
│   │   ├── 03
│   │   ├── 04
│   │   ├── 05
│   │   ├── 06
│   │   ├── 09
│   │   ├── 0a
│   │   ├── 0d
│   │   ├── 0e
│   │   ├── 0f
│   │   ├── 11
│   │   ├── 12
│   │   ├── 13
│   │   ├── 14
│   │   ├── 16
│   │   ├── 17
│   │   ├── 18
│   │   ├── 19
│   │   ├── 1a
│   │   ├── 1b
│   │   ├── 1f
│   │   ├── 23
│   │   ├── 28
│   │   ├── 29
│   │   ├── 2a
│   │   ├── 2c
│   │   ├── 2d
│   │   ├── 2e
│   │   ├── 2f
│   │   ├── 30
│   │   ├── 31
│   │   ├── 32
│   │   ├── 35
│   │   ├── 36
│   │   ├── 3b
│   │   ├── 3c
│   │   ├── 41
│   │   ├── 42
│   │   ├── 43
│   │   ├── 44
│   │   ├── 45
│   │   ├── 46
│   │   ├── 47
│   │   ├── 49
│   │   ├── 4a
│   │   ├── 4b
│   │   ├── 4d
│   │   ├── 4f
│   │   ├── 52
│   │   ├── 53
│   │   ├── 54
│   │   ├── 55
│   │   ├── 56
│   │   ├── 58
│   │   ├── 5a
│   │   ├── 5b
│   │   ├── 5c
│   │   ├── 5d
│   │   ├── 5f
│   │   ├── 60
│   │   ├── 61
│   │   ├── 63
│   │   ├── 65
│   │   ├── 66
│   │   ├── 68
│   │   ├── 6b
│   │   ├── 6c
│   │   ├── 6e
│   │   ├── 6f
│   │   ├── 73
│   │   ├── 74
│   │   ├── 75
│   │   ├── 77
│   │   ├── 78
│   │   ├── 7a
│   │   ├── 7c
│   │   ├── 7d
│   │   ├── 80
│   │   ├── 82
│   │   ├── 83
│   │   ├── 84
│   │   ├── 85
│   │   ├── 86
│   │   ├── 88
│   │   ├── 8a
│   │   ├── 8b
│   │   ├── 8c
│   │   ├── 8e
│   │   ├── 8f
│   │   ├── 90
│   │   ├── 91
│   │   ├── 92
│   │   ├── 94
│   │   ├── 95
│   │   ├── 96
│   │   ├── 97
│   │   ├── 98
│   │   ├── 99
│   │   ├── 9d
│   │   ├── 9e
│   │   ├── 9f
│   │   ├── a3
│   │   ├── a4
│   │   ├── a5
│   │   ├── a6
│   │   ├── a8
│   │   ├── aa
│   │   ├── ab
│   │   ├── ac
│   │   ├── ae
│   │   ├── b1
│   │   ├── b4
│   │   ├── b5
│   │   ├── b6
│   │   ├── bb
│   │   ├── bc
│   │   ├── bf
│   │   ├── c0
│   │   ├── c1
│   │   ├── c2
│   │   ├── c3
│   │   ├── c5
│   │   ├── c6
│   │   ├── c8
│   │   ├── c9
│   │   ├── cb
│   │   ├── cc
│   │   ├── cf
│   │   ├── d3
│   │   ├── d5
│   │   ├── d6
│   │   ├── d7
│   │   ├── d9
│   │   ├── da
│   │   ├── db
│   │   ├── dd
│   │   ├── e0
│   │   ├── e4
│   │   ├── e6
│   │   ├── e7
│   │   ├── e8
│   │   ├── eb
│   │   ├── ed
│   │   ├── ee
│   │   ├── ef
│   │   ├── f0
│   │   ├── f1
│   │   ├── f2
│   │   ├── f3
│   │   ├── f4
│   │   ├── f6
│   │   ├── f8
│   │   ├── f9
│   │   ├── fa
│   │   ├── fd
│   │   ├── fe
│   │   ├── ff
│   │   ├── info
│   │   ├── pack
│   ├── packed-refs
│   ├── refs
│   │   ├── heads
│   │   ├── remotes
│   │   ├── tags
├── 📁 1-chaos
│   ├── summarize.sh
├── 🧾 1-pessimism.cff
├── 📓 2-bge.md
├── 📁 2-frenzy
│   ├── summarize.sh
├── 📁 3-emotion
│   ├── summarize.sh
├── 📓 3-robustness.md
├── 📁 4-dionysian
│   ├── summarize.sh
├── 📓 4-dionysus.md
├── 📁 5-algorithm
│   ├── summarize.sh
├── 📓 5-science.md
├── 📁 6-binary
│   ├── summarize.sh
├── 📓 6-morality.md
├── 📓 README.md
├── 📁 kitabo
│   ├── 📓 README.md
│   ├── 📁 ensi
│   │   ├── 📁 _bibliography
│   │   ├── 📁 _build
│   │   ├── _config.yml
│   │   ├── 📁 _static
│   │   ├── _toc.yml
│   │   ├── 📁 act1
│   │   ├── 📁 act2
│   │   ├── 📁 act3
│   │   ├── 📓 bibliography.md
│   │   ├── 📁 figures
│   │   ├── index.ipynb
│   │   ├── 📁 media
│   │   ├── 📁 myenv
│   │   ├── 📁 nis
│   │   ├── 📁 pdfs
│   │   ├── requirements.in
│   │   ├── requirements.txt
│   │   ├── 📁 scripts
│   │   ├── 📁 testbin
│   │   ├── 📁 ukubona
│   │   ├── 📁 ukuzimba

✅ Done scanning.
